esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS.h
#ifndef MDNS_H
#define MDNS_H

#include <functional>   // for UdpContext.h
#include "WiFiUdp.h"
#include "lwip/udp.h"
#include "debug.h"
#include "include/UdpContext.h"
#include "LEATimeFlag.h"

#include "ESP8266WiFi.h"


namespace esp8266 {

/**
 * LEAmDNS
 */
namespace MDNSImplementation {

//this should be defined at build time
#ifndef ARDUINO_BOARD
#define ARDUINO_BOARD "generic"
#endif

#define MDNS_IP4_SUPPORT
//#define MDNS_IP6_SUPPORT


#ifdef MDNS_IP4_SUPPORT
    #define MDNS_IP4_SIZE               4
#endif
#ifdef MDNS_IP6_SUPPORT
    #define MDNS_IP6_SIZE               16
#endif
/*
 * Maximum length for all service txts for one service
 */
#define MDNS_SERVICE_TXT_MAXLENGTH      1300
/*
 * Maximum length for a full domain name eg. MyESP._http._tcp.local
 */
#define MDNS_DOMAIN_MAXLENGTH           256
/*
 * Maximum length of on label in a domain name (length info fits into 6 bits)
 */
#define MDNS_DOMAIN_LABEL_MAXLENGTH     63
/*
 * Maximum length of a service name eg. http
 */
#define MDNS_SERVICE_NAME_LENGTH        15
/*
 * Maximum length of a service protocol name eg. tcp
 */
#define MDNS_SERVICE_PROTOCOL_LENGTH    3
/*
 * Default timeout for static service queries
 */
#define MDNS_QUERYSERVICES_WAIT_TIME    1000


/**
 * MDNSResponder
 */
class MDNSResponder {
public:
    /* INTERFACE */
    MDNSResponder(void);
    virtual ~MDNSResponder(void);
    
    // Start the MDNS responder by setting the default hostname
    // Later call MDNS::update() in every 'loop' to run the process loop
    // (probing, announcing, responding, ...)
    bool begin(const char* p_pcHostname);
    bool begin(const String& p_strHostname) {return begin(p_strHostname.c_str());}
        // for compatibility
        bool begin(const char* p_pcHostname,
                   IPAddress p_IPAddress,       // ignored
                   uint32_t p_u32TTL = 120);    // ignored
        bool begin(const String& p_strHostname,
                   IPAddress p_IPAddress,       // ignored
                   uint32_t p_u32TTL = 120) {   // ignored
            return begin(p_strHostname.c_str(), p_IPAddress, p_u32TTL);
        }
    // Finish MDNS processing
    bool close(void);

    // Change hostname (probing is restarted)
    bool setHostname(const char* p_pcHostname);
        // for compatibility...
        bool setHostname(String p_strHostname);
    
    /**
     * hMDNSService (opaque handle to access the service)
     */
    typedef const void*     hMDNSService;

    // Add a new service to the MDNS responder. If no name (instance name) is given (p_pcName = 0)
    // the current hostname is used. If the hostname is changed later, the instance names for
    // these 'auto-named' services are changed to the new name also (and probing is restarted).
    // The usual '_' before p_pcService (eg. http) and protocol (eg. tcp) may be given.
    hMDNSService addService(const char* p_pcName,
                            const char* p_pcService,
                            const char* p_pcProtocol,
                            uint16_t p_u16Port);
    // Removes a service from the MDNS responder
    bool removeService(const hMDNSService p_hService);
    bool removeService(const char* p_pcInstanceName,
                       const char* p_pcServiceName,
                       const char* p_pcProtocol);
        // for compatibility...
        bool addService(String p_strServiceName,
                        String p_strProtocol,
                        uint16_t p_u16Port);
    

    // Change the services instance name (and restart probing).
    bool setServiceName(const hMDNSService p_hService,
                        const char* p_pcInstanceName);
        //for compatibility
        //Warning: this has the side effect of changing the hostname.
        //TODO: implement instancename different from hostname
        void setInstanceName(const char* p_pcHostname) {setHostname(p_pcHostname);}
    
    /**
     * hMDNSTxt (opaque handle to access the TXT items)
     */
    typedef void*   hMDNSTxt;

    // Add a (static) MDNS TXT item ('key' = 'value') to the service
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           const char* p_pcValue);
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           uint32_t p_u32Value);
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           uint16_t p_u16Value);
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           uint8_t p_u8Value);
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           int32_t p_i32Value);
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           int16_t p_i16Value);
    hMDNSTxt addServiceTxt(const hMDNSService p_hService,
                           const char* p_pcKey,
                           int8_t p_i8Value);
    
    // Remove an existing (static) MDNS TXT item from the service
    bool removeServiceTxt(const hMDNSService p_hService,
                          const hMDNSTxt p_hTxt);
    bool removeServiceTxt(const hMDNSService p_hService,
                          const char* p_pcKey);
    bool removeServiceTxt(const char* p_pcinstanceName,
                          const char* p_pcServiceName,
                          const char* p_pcProtocol,
                          const char* p_pcKey);
        // for compatibility...
        bool addServiceTxt(const char* p_pcService,
                           const char* p_pcProtocol,
                           const char* p_pcKey,
                           const char* p_pcValue);
        bool addServiceTxt(String p_strService,
                           String p_strProtocol,
                           String p_strKey,
                           String p_strValue);
    
    /**
     * MDNSDynamicServiceTxtCallbackFn
     * Callback function for dynamic MDNS TXT items
     */
    typedef bool (*MDNSDynamicServiceTxtCallbackFn)(MDNSResponder* p_pMDNSResponder,
                                                    const hMDNSService p_hService,
                                                    void* p_pUserdata);

    // Set a global callback for dynamic MDNS TXT items. The callback function is called
    // every time, a TXT item is needed for one of the installed services.
    bool setDynamicServiceTxtCallback(MDNSDynamicServiceTxtCallbackFn p_fnCallback,
                                      void* p_pUserdata);
    // Set a service specific callback for dynamic MDNS TXT items. The callback function
    // is called every time, a TXT item is needed for the given service.
    bool setDynamicServiceTxtCallback(const hMDNSService p_hService,
                                      MDNSDynamicServiceTxtCallbackFn p_fnCallback,
                                      void* p_pUserdata);
    
    // Add a (dynamic) MDNS TXT item ('key' = 'value') to the service
    // Dynamic TXT items are removed right after one-time use. So they need to be added
    // every time the value s needed (via callback).
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  const char* p_pcValue);
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  uint32_t p_u32Value);
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  uint16_t p_u16Value);
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  uint8_t p_u8Value);
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  int32_t p_i32Value);
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  int16_t p_i16Value);
    hMDNSTxt addDynamicServiceTxt(hMDNSService p_hService,
                                  const char* p_pcKey,
                                  int8_t p_i8Value);

    // Perform a (static) service query. The function returns after p_u16Timeout milliseconds
    // The answers (the number of received answers is returned) can be retrieved by calling
    // - answerHostname (or hostname)
    // - answerIP (or IP)
    // - answerPort (or port)
    uint32_t queryService(const char* p_pcService,
                          const char* p_pcProtocol,
                          const uint16_t p_u16Timeout = MDNS_QUERYSERVICES_WAIT_TIME);
    bool removeQuery(void);
        // for compatibility...
        uint32_t queryService(String p_strService,
                              String p_strProtocol);

