esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS.h
    const char* answerHostname(const uint32_t p_u32AnswerIndex);
    IPAddress answerIP(const uint32_t p_u32AnswerIndex);
    uint16_t answerPort(const uint32_t p_u32AnswerIndex);
        // for compatibility...
        String hostname(const uint32_t p_u32AnswerIndex);
        IPAddress IP(const uint32_t p_u32AnswerIndex);
        uint16_t port(const uint32_t p_u32AnswerIndex);
        
    /**
     * hMDNSServiceQuery (opaque handle to access dynamic service queries)
     */
    typedef const void*     hMDNSServiceQuery;
    
    /**
     * enuServiceQueryAnswerType
     */
    typedef enum _enuServiceQueryAnswerType {
        ServiceQueryAnswerType_ServiceDomain        = (1 << 0), // Service instance name
        ServiceQueryAnswerType_HostDomainAndPort    = (1 << 1), // Host domain and service port
        ServiceQueryAnswerType_Txts                 = (1 << 2), // TXT items
#ifdef MDNS_IP4_SUPPORT
        ServiceQueryAnswerType_IP4Address           = (1 << 3), // IP4 address
#endif
#ifdef MDNS_IP6_SUPPORT
        ServiceQueryAnswerType_IP6Address           = (1 << 4), // IP6 address
#endif
    } enuServiceQueryAnswerType;

    /**
     * MDNSServiceQueryCallbackFn
     * Callback function for received answers for dynamic service queries
     */
    typedef bool (*MDNSServiceQueryCallbackFn)(MDNSResponder* p_pMDNSResponder,
                                               const hMDNSServiceQuery p_hServiceQuery, // dynamic service query handle
                                               uint32_t p_u32AnswerIndex,               // index of the updated answer
                                               uint32_t p_u32ServiceQueryAnswerMask,    // flag for the updated answer item
                                               bool p_bSetContent,                      // true: Answer component set, false: component deleted
                                               void* p_pUserdata);                      // pUserdata set via 'installServiceQuery'

    // Install a dynamic service query. For every received answer (part) the given callback
    // function is called. The query will be updated every time, the TTL for an answer
    // has timed-out.
    // The answers can also be retrieved by calling
    // - answerCount
    // - answerServiceDomain
    // - hasAnswerHostDomain/answerHostDomain
    // - hasAnswerIP4Address/answerIP4Address
    // - hasAnswerIP6Address/answerIP6Address
    // - hasAnswerPort/answerPort
    // - hasAnswerTxts/answerTxts
    hMDNSServiceQuery installServiceQuery(const char* p_pcService,
                                          const char* p_pcProtocol,
                                          MDNSServiceQueryCallbackFn p_fnCallback,
                                          void* p_pUserdata);
    // Remove a dynamic service query
    bool removeServiceQuery(hMDNSServiceQuery p_hServiceQuery);

    uint32_t answerCount(const hMDNSServiceQuery p_hServiceQuery);
    const char* answerServiceDomain(const hMDNSServiceQuery p_hServiceQuery,
                                    const uint32_t p_u32AnswerIndex);
    bool hasAnswerHostDomain(const hMDNSServiceQuery p_hServiceQuery,
                             const uint32_t p_u32AnswerIndex);
    const char* answerHostDomain(const hMDNSServiceQuery p_hServiceQuery,
                                 const uint32_t p_u32AnswerIndex);
#ifdef MDNS_IP4_SUPPORT
    bool hasAnswerIP4Address(const hMDNSServiceQuery p_hServiceQuery,
                             const uint32_t p_u32AnswerIndex);
    uint32_t answerIP4AddressCount(const hMDNSServiceQuery p_hServiceQuery,
                                   const uint32_t p_u32AnswerIndex);
    IPAddress answerIP4Address(const hMDNSServiceQuery p_hServiceQuery,
                               const uint32_t p_u32AnswerIndex,
                               const uint32_t p_u32AddressIndex);
#endif
#ifdef MDNS_IP6_SUPPORT
    bool hasAnswerIP6Address(const hMDNSServiceQuery p_hServiceQuery,
                             const uint32_t p_u32AnswerIndex);
    uint32_t answerIP6AddressCount(const hMDNSServiceQuery p_hServiceQuery,
                                   const uint32_t p_u32AnswerIndex);
    IPAddress answerIP6Address(const hMDNSServiceQuery p_hServiceQuery,
                               const uint32_t p_u32AnswerIndex,
                               const uint32_t p_u32AddressIndex);
#endif
    bool hasAnswerPort(const hMDNSServiceQuery p_hServiceQuery,
                       const uint32_t p_u32AnswerIndex);
    uint16_t answerPort(const hMDNSServiceQuery p_hServiceQuery,
                        const uint32_t p_u32AnswerIndex);
    bool hasAnswerTxts(const hMDNSServiceQuery p_hServiceQuery,
                       const uint32_t p_u32AnswerIndex);
    // Get the TXT items as a ';'-separated string
    const char* answerTxts(const hMDNSServiceQuery p_hServiceQuery,
                           const uint32_t p_u32AnswerIndex);
    
    /**
     * MDNSProbeResultCallbackFn
     * Callback function for (host and service domain) probe results
     */
    typedef bool (*MDNSProbeResultCallbackFn)(MDNSResponder* p_pMDNSResponder,
                                              const char* p_pcDomainName,
                                              const hMDNSService p_hMDNSService,    // 0 for host domain
                                              bool p_bProbeResult,
                                              void* p_pUserdata);

    // Set a global callback function for host and service probe results
    // The callback function is called, when the probeing for the host domain
    // (or a service domain, which hasn't got a service specific callback)
    // Succeededs or fails.
    // In case of failure, the failed domain name should be changed.
    bool setProbeResultCallback(MDNSProbeResultCallbackFn p_fnCallback,
                                void* p_pUserdata);
    // Set a service specific probe result callcack
    bool setServiceProbeResultCallback(const hMDNSService p_hService,
                                       MDNSProbeResultCallbackFn p_fnCallback,
                                       void* p_pUserdata);
    
    // Application should call this whenever AP is configured/disabled
    bool notifyAPChange(void);
    
    // 'update' should be called in every 'loop' to run the MDNS processing
    bool update(void);
    
