esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS.h
    // 'announce' can be called every time, the configuration of some service
    // changes. Mainly, this would be changed content of TXT items.
    bool announce(void);

    // Enable OTA update
    hMDNSService enableArduino(uint16_t p_u16Port,
                               bool p_bAuthUpload = false);
    
    // Domain name helper
    static bool indexDomain(char*& p_rpcDomain,
                            const char* p_pcDivider = "-",
                            const char* p_pcDefaultDomain = 0);
    
protected:
    /** STRUCTS **/
    /**
     * stcMDNSServiceTxt
     */
    struct stcMDNSServiceTxt {
        stcMDNSServiceTxt* m_pNext;
        char*              m_pcKey;
        char*              m_pcValue;
        bool               m_bTemp;
        
        stcMDNSServiceTxt(const char* p_pcKey = 0,
                           const char* p_pcValue = 0,
                           bool p_bTemp = false);
        stcMDNSServiceTxt(const stcMDNSServiceTxt& p_Other);
        ~stcMDNSServiceTxt(void);
        
        stcMDNSServiceTxt& operator=(const stcMDNSServiceTxt& p_Other);
        bool clear(void);
        
        char* allocKey(size_t p_stLength);
        bool setKey(const char* p_pcKey,
                    size_t p_stLength);
        bool setKey(const char* p_pcKey);
        bool releaseKey(void);
        
        char* allocValue(size_t p_stLength);
        bool setValue(const char* p_pcValue,
                      size_t p_stLength);
        bool setValue(const char* p_pcValue);
        bool releaseValue(void);
        
        bool set(const char* p_pcKey,
                 const char* p_pcValue,
                 bool p_bTemp = false);
        
        bool update(const char* p_pcValue);
        
        size_t length(void) const;
    };
    
    /**
     * stcMDNSTxts
     */
    struct stcMDNSServiceTxts {
        stcMDNSServiceTxt*  m_pTxts;
        
        stcMDNSServiceTxts(void);
        stcMDNSServiceTxts(const stcMDNSServiceTxts& p_Other);
        ~stcMDNSServiceTxts(void);
        
        stcMDNSServiceTxts& operator=(const stcMDNSServiceTxts& p_Other);
        
        bool clear(void);
        
        bool add(stcMDNSServiceTxt* p_pTxt);
        bool remove(stcMDNSServiceTxt* p_pTxt);

        bool removeTempTxts(void);
        
        stcMDNSServiceTxt* find(const char* p_pcKey);
        const stcMDNSServiceTxt* find(const char* p_pcKey) const;
        stcMDNSServiceTxt* find(const stcMDNSServiceTxt* p_pTxt);
        
        uint16_t length(void) const;
        
        size_t c_strLength(void) const;
        bool c_str(char* p_pcBuffer);
        
        size_t bufferLength(void) const;
        bool buffer(char* p_pcBuffer);
        
        bool compare(const stcMDNSServiceTxts& p_Other) const;
        bool operator==(const stcMDNSServiceTxts& p_Other) const;
        bool operator!=(const stcMDNSServiceTxts& p_Other) const;
    };
    
    /**
     * enuContentFlags
     */
    typedef enum _enuContentFlags {
        // Host
        ContentFlag_A           = 0x01,
        ContentFlag_PTR_IP4     = 0x02,
        ContentFlag_PTR_IP6     = 0x04,
        ContentFlag_AAAA        = 0x08,
        // Service
        ContentFlag_PTR_TYPE    = 0x10,
        ContentFlag_PTR_NAME    = 0x20,
        ContentFlag_TXT         = 0x40,
        ContentFlag_SRV         = 0x80,
    } enuContentFlags;

    /**
     * stcMDNS_MsgHeader
     */
    struct stcMDNS_MsgHeader {
        uint16_t        m_u16ID;            // Identifier
        bool            m_1bQR      : 1;    // Query/Response flag
        unsigned char   m_4bOpcode  : 4;    // Operation code
        bool            m_1bAA      : 1;    // Authoritative Answer flag
        bool            m_1bTC      : 1;    // Truncation flag
        bool            m_1bRD      : 1;    // Recursion desired
        bool            m_1bRA      : 1;    // Recursion available
        unsigned char   m_3bZ       : 3;    // Zero
        unsigned char   m_4bRCode   : 4;    // Response code
        uint16_t        m_u16QDCount;       // Question count
        uint16_t        m_u16ANCount;       // Answer count
        uint16_t        m_u16NSCount;       // Authority Record count
        uint16_t        m_u16ARCount;       // Additional Record count
        
        stcMDNS_MsgHeader(uint16_t p_u16ID = 0,
                           bool p_bQR = false,
                           unsigned char p_ucOpcode = 0,
                           bool p_bAA = false,
                           bool p_bTC = false,
                           bool p_bRD = false,
                           bool p_bRA = false,
                           unsigned char p_ucRCode = 0,
                           uint16_t p_u16QDCount = 0,
                           uint16_t p_u16ANCount = 0,
                           uint16_t p_u16NSCount = 0,
                           uint16_t p_u16ARCount = 0);
    };
        
    /**
     * stcMDNS_RRDomain
     */
    struct stcMDNS_RRDomain {
        char            m_acName[MDNS_DOMAIN_MAXLENGTH];    // Encoded domain name
        uint16_t        m_u16NameLength;                    // Length (incl. '\0')
        
        stcMDNS_RRDomain(void);
        stcMDNS_RRDomain(const stcMDNS_RRDomain& p_Other);
        
        stcMDNS_RRDomain& operator=(const stcMDNS_RRDomain& p_Other);
        
        bool clear(void);
        
        bool addLabel(const char* p_pcLabel,
                      bool p_bPrependUnderline = false);
        
        bool compare(const stcMDNS_RRDomain& p_Other) const;
        bool operator==(const stcMDNS_RRDomain& p_Other) const;
        bool operator!=(const stcMDNS_RRDomain& p_Other) const;
        bool operator>(const stcMDNS_RRDomain& p_Other) const;
        
        size_t c_strLength(void) const;
        bool c_str(char* p_pcBuffer);
    };
    
    /**
     * stcMDNS_RRAttributes
     */
    struct stcMDNS_RRAttributes {
        uint16_t            m_u16Type;      // Type
        uint16_t            m_u16Class;     // Class, nearly always 'IN'
        
