esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS.h
        stcMDNS_RRAttributes(uint16_t p_u16Type = 0,
                              uint16_t p_u16Class = 1 /*DNS_RRCLASS_IN Internet*/);
        stcMDNS_RRAttributes(const stcMDNS_RRAttributes& p_Other);
        
        stcMDNS_RRAttributes& operator=(const stcMDNS_RRAttributes& p_Other);
    };
    
    /**
     * stcMDNS_RRHeader
     */
    struct stcMDNS_RRHeader {
        stcMDNS_RRDomain        m_Domain;
        stcMDNS_RRAttributes    m_Attributes;
        
        stcMDNS_RRHeader(void);
        stcMDNS_RRHeader(const stcMDNS_RRHeader& p_Other);
        
        stcMDNS_RRHeader& operator=(const stcMDNS_RRHeader& p_Other);

        bool clear(void);
    };
    
    /**
     * stcMDNS_RRQuestion
     */
    struct stcMDNS_RRQuestion {
        stcMDNS_RRQuestion*     m_pNext;
        stcMDNS_RRHeader        m_Header;
        bool                    m_bUnicast;     // Unicast reply requested
        
        stcMDNS_RRQuestion(void);
    };
    
    /**
     * enuAnswerType
     */
    typedef enum _enuAnswerType {
        AnswerType_A,
        AnswerType_PTR,
        AnswerType_TXT,
        AnswerType_AAAA,
        AnswerType_SRV,
        AnswerType_Generic
    } enuAnswerType;
    
    /**
     * stcMDNS_RRAnswer
     */
    struct stcMDNS_RRAnswer {
        stcMDNS_RRAnswer*   m_pNext;
        const enuAnswerType m_AnswerType;
        stcMDNS_RRHeader    m_Header;
        bool                m_bCacheFlush;  // Cache flush command bit
        uint32_t            m_u32TTL;       // Validity time in seconds
        
        virtual ~stcMDNS_RRAnswer(void);
        
        enuAnswerType answerType(void) const;
        
        bool clear(void);
        
    protected:
        stcMDNS_RRAnswer(enuAnswerType p_AnswerType,
                          const stcMDNS_RRHeader& p_Header,
                          uint32_t p_u32TTL);
    };
    
#ifdef MDNS_IP4_SUPPORT
    /**
     * stcMDNS_RRAnswerA
     */
    struct stcMDNS_RRAnswerA : public stcMDNS_RRAnswer {
        IPAddress           m_IPAddress;
        
        stcMDNS_RRAnswerA(const stcMDNS_RRHeader& p_Header,
                           uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerA(void);
        
        bool clear(void);
    };
#endif

    /**
     * stcMDNS_RRAnswerPTR
     */
    struct stcMDNS_RRAnswerPTR : public stcMDNS_RRAnswer {
        stcMDNS_RRDomain    m_PTRDomain;
        
        stcMDNS_RRAnswerPTR(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerPTR(void);
        
        bool clear(void);
    };
    
    /**
     * stcMDNS_RRAnswerTXT
     */
    struct stcMDNS_RRAnswerTXT : public stcMDNS_RRAnswer {
        stcMDNSServiceTxts  m_Txts;
        
        stcMDNS_RRAnswerTXT(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerTXT(void);
        
        bool clear(void);
    };
    
#ifdef MDNS_IP6_SUPPORT
    /**
     * stcMDNS_RRAnswerAAAA
     */
    struct stcMDNS_RRAnswerAAAA : public stcMDNS_RRAnswer {
        //TODO: IP6Address          m_IPAddress;
        
        stcMDNS_RRAnswerAAAA(const stcMDNS_RRHeader& p_Header,
                              uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerAAAA(void);
        
        bool clear(void);
    };
#endif

    /**
     * stcMDNS_RRAnswerSRV
     */
    struct stcMDNS_RRAnswerSRV : public stcMDNS_RRAnswer {
        uint16_t            m_u16Priority;
        uint16_t            m_u16Weight;
        uint16_t            m_u16Port;
        stcMDNS_RRDomain    m_SRVDomain;
        
        stcMDNS_RRAnswerSRV(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerSRV(void);
        
        bool clear(void);
    };
    
    /**
     * stcMDNS_RRAnswerGeneric
     */
    struct stcMDNS_RRAnswerGeneric : public stcMDNS_RRAnswer {
        uint16_t            m_u16RDLength;  // Length of variable answer
        uint8_t*            m_pu8RDData;    // Offset of start of variable answer in packet
        
        stcMDNS_RRAnswerGeneric(const stcMDNS_RRHeader& p_Header,
                                 uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerGeneric(void);
        
        bool clear(void);
    };


    /**
     * enuProbingStatus
     */
    typedef enum _enuProbingStatus {
        ProbingStatus_WaitingForData,
        ProbingStatus_ReadyToStart,
        ProbingStatus_InProgress,
        ProbingStatus_Done
    } enuProbingStatus;

    /**
     * stcProbeInformation
     */
    struct stcProbeInformation {
        enuProbingStatus                m_ProbingStatus;
        uint8_t                         m_u8ProbesSent;
        clsMDNSTimeFlag                  m_NextProbeTimeFlag;
        bool                            m_bConflict;
        bool                            m_bTiebreakNeeded;
        MDNSProbeResultCallbackFn       m_fnProbeResultCallback;
        void*                           m_pProbeResultCallbackUserdata;

        stcProbeInformation(void);

        bool clear(bool p_bClearUserdata = false);
    };


    /**
     * stcMDNSService
     */
    struct stcMDNSService {
        stcMDNSService*                 m_pNext;
        char*                           m_pcName;
        bool                            m_bAutoName;    // Name was set automatically to hostname (if no name was supplied)
        char*                           m_pcService;
        char*                           m_pcProtocol;
        uint16_t                        m_u16Port;
        uint8_t                         m_u8ReplyMask;
        stcMDNSServiceTxts              m_Txts;
        MDNSDynamicServiceTxtCallbackFn m_fnTxtCallback;
        void*                           m_pTxtCallbackUserdata;
        stcProbeInformation             m_ProbeInformation;

        stcMDNSService(const char* p_pcName = 0,
                        const char* p_pcService = 0,
                        const char* p_pcProtocol = 0);
        ~stcMDNSService(void);

        bool setName(const char* p_pcName);
        bool releaseName(void);
        
        bool setService(const char* p_pcService);
        bool releaseService(void);
        
        bool setProtocol(const char* p_pcProtocol);
        bool releaseProtocol(void);
    };

    /**
     * stcMDNSServiceQuery
     */
    struct stcMDNSServiceQuery {
        /**
         * stcAnswer
         */
        struct stcAnswer {
            /**
             * stcTTL
             */
            struct stcTTL {
                clsMDNSTimeFlag  m_TTLTimeFlag;
                bool            m_bUpdateScheduled;

                stcTTL(uint32_t p_u32TTL = 0);
                bool set(uint32_t p_u32TTL);

                bool has80Percent(void) const;
                bool isOutdated(void) const;
            };
#ifdef MDNS_IP4_SUPPORT
            /**
             * stcIP4Address
             */
            struct stcIP4Address {
                stcIP4Address*  m_pNext;
                IPAddress       m_IPAddress;
                stcTTL          m_TTL;
                
                stcIP4Address(IPAddress p_IPAddress,
                               uint32_t p_u32TTL = 0);
            };
#endif
#ifdef MDNS_IP6_SUPPORT
            /**
             * stcIP6Address
             */
            struct stcIP6Address {
                stcIP6Address*  m_pNext;
                IP6Address      m_IPAddress;
                stcTTL          m_TTL;
            };
#endif

            stcAnswer*          m_pNext;
            // The service domain is the first 'answer' (from PTR answer, using service and protocol) to be set
            // Defines the key for additional answer, like host domain, etc.
            stcMDNS_RRDomain    m_ServiceDomain;    // 1. level answer (PTR), eg. MyESP._http._tcp.local
            char*               m_pcServiceDomain;
            stcTTL              m_TTLServiceDomain;
            stcMDNS_RRDomain    m_HostDomain;       // 2. level answer (SRV, using service domain), eg. esp8266.local
            char*               m_pcHostDomain;
            uint16_t            m_u16Port;          // 2. level answer (SRV, using service domain), eg. 5000
            stcTTL              m_TTLHostDomainAndPort;
            stcMDNSServiceTxts  m_Txts;             // 2. level answer (TXT, using service domain), eg. c#=1
            char*               m_pcTxts;
            stcTTL              m_TTLTxts;
#ifdef MDNS_IP4_SUPPORT
            stcIP4Address*      m_pIP4Addresses;    // 3. level answer (A, using host domain), eg. 123.456.789.012
#endif
#ifdef MDNS_IP6_SUPPORT
            stcIP6Address*      m_pIP6Addresses;    // 3. level answer (AAAA, using host domain), eg. 1234::09
#endif
            uint32_t            m_u32ContentFlags;

            stcAnswer(void);
            ~stcAnswer(void);

            bool clear(void);
            
            char* allocServiceDomain(size_t p_stLength);
            bool releaseServiceDomain(void);
            
